In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline
sns.set_style('whitegrid')

In [2]:
pd.set_option("display.max_columns", None)
pd.set_option("display.float_format", "{:,.2f}".format)

In [3]:
all_ages = pd.read_csv("../data/raw/all-ages.csv")
recent_grads = pd.read_csv("../data/raw/recent-grads.csv")
grad_students = pd.read_csv("../data/raw/grad-students.csv")
women_stem = pd.read_csv("../data/raw/women-stem.csv")
majors_list = pd.read_csv("../data/raw/majors-list.csv")

In [4]:
datasets = {
    "all_ages": all_ages,
    "recent_grads": recent_grads,
    "grad_students": grad_students,
    "women_stem": women_stem,
    "majors_list": majors_list
}

for name, df in datasets.items():
    print(f"\n{name.upper()}")
    display(df.head())
    print(df.info())

ALL_AGES

,index,Major_code,Major,Major_category,Total,Employed,Employed_full_time_year_round,Unemployed,Unemployment_rate,Median,P25th,P75th
0,0,1100,GENERAL AGRICULTURE,Agriculture & Natural Resources,128148,90245,74078,2423,0.03,50000,34000,"80,000.00"
1,1,1101,AGRICULTURE PRODUCTION AND MANAGEMENT,Agriculture & Natural Resources,95326,76865,64240,2266,0.03,54000,36000,"80,000.00"
2,2,1102,AGRICULTURAL ECONOMICS,Agriculture & Natural Resources,33955,26321,22810,821,0.03,63000,40000,"98,000.00"
3,3,1103,ANIMAL SCIENCES,Agriculture & Natural Resources,103549,81177,64937,3619,0.04,46000,30000,"72,000.00"
4,4,1104,FOOD SCIENCE,Agriculture & Natural Resources,24280,17281,12722,894,0.05,62000,38500,"90,000.00"

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 173 entries, 0 to 172
Data columns (total 12 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   index                          173 non-null    int64
 1   Major_code                     173 non-null    int64
 2   Major                          173 non-null    object
 3   Major_category                 173 non-null    object
 4   Total                          173 non-null    int64
 5   Employed                       173 non-null    int64
 6   Employed_full_time_year_round  173 non-null    int64
 7   Unemployed                     173 non-null    int64
 8   Unemployment_rate              173 non-null    float64
 9   Median                         173 non-null    int64
 10  P25th                          173 non-null    int64
 11  P75th                          173 non-null    float64
dtypes: float64(2), int64(8), object(2)
memory usage: 16.3+ KB
None

RECENT_GRADS

,index,Rank,Major_code,Major,Major_category,Total,Sample_size,Men,Women,ShareWomen,Employed,Full_time,Part_time,Full_time_year_round,Unemployed,Unemployment_rate,Median,P25th,P75th,College_jobs,Non_college_jobs,Low_wage_jobs
0,0,1,2419,PETROLEUM ENGINEERING,Engineering,2339,36,2057,282,0.12,1976,1849,270,1207,37,0.02,110000,95000,125000,1534,364,193
1,1,2,2416,MINING AND MINERAL ENGINEERING,Engineering,756,7,679,77,0.10,640,556,170,388,85,0.12,75000,55000,90000,350,257,50
2,2,3,2415,METALLURGICAL ENGINEERING,Engineering,856,3,725,131,0.15,648,558,133,340,16,0.02,73000,50000,105000,456,176,0
3,3,4,2417,NAVAL ARCHITECTURE AND MARINE ENGINEERING,Engineering,1258,16,1123,135,0.11,758,1069,150,692,40,0.05,70000,43000,80000,529,102,0
4,4,5,2405,CHEMICAL ENGINEERING,Engineering,32260,289,21239,11021,0.34,25694,23170,5180,16697,1672,0.06,65000,50000,75000,18314,4440,972

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 173 entries, 0 to 172
Data columns (total 22 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   index                 173 non-null    int64
 1   Rank                  173 non-null    int64
 2   Major_code            173 non-null    int64
 3   Major                 173 non-null    object
 4   Major_category        173 non-null    object
 5   Total                 173 non-null    int64
 6   Sample_size           173 non-null    int64
 7   Men                   173 non-null    int64
 8   Women                 173 non-null    int64
 9   ShareWomen            173 non-null    float64
 10  Employed              173 non-null    int64
 11  Full_time             173 non-null    int64
 12  Part_time             173 non-null    int64
 13  Full_time_year_round  173 non-null    int64
 14  Unemployed            173 non-null    int64
 15  Unemployment_rate     172 non-null    float64
 16  Median                173 non-null    int64
 17  P25th                 173 non-null    int64
 18  P75th                 173 non-null    int64
 19  College_jobs          173 non-null    int64
 20  Non_college_jobs      173 non-null    int64
 21  Low_wage_jobs         173 non-null    int64
dtypes: float64(2), int64(18), object(2)
memory usage: 29.9+ KB
None

GRAD_STUDENTS

,index,Major_code,Major,Major_category,Grad_total,Grad_sample_size,Grad_employed,Grad_full_time_year_round,Grad_unemployed,Grad_unemployment_rate,Grad_median,Grad_P25,Grad_P75,Nongrad_total,Nongrad_employed,Nongrad_full_time_year_round,Nongrad_unemployed,Nongrad_unemployment_rate,Nongrad_median,Nongrad_P25,Nongrad_P75,Grad_share,Grad_premium
0,0,5601,CONSTRUCTION SERVICES,Industrial Arts & Consumer Services,9173,200,7098,6511,681,0.09,"75,000.00",53000,"110,000.00",86062,73607,62435,3928,0.05,"65,000.00",47000,"98,000.00",0.10,0.15
1,1,6004,COMMERCIAL ART AND GRAPHIC DESIGN,Arts,53864,882,40492,29553,2482,0.06,"60,000.00",40000,"89,000.00",461977,347166,250596,25484,0.07,"48,000.00",34000,"71,000.00",0.10,0.25
2,2,6211,HOSPITALITY MANAGEMENT,Business,24417,437,18368,14784,1465,0.07,"65,000.00",45000,"100,000.00",179335,145597,113579,7409,0.05,"50,000.00",35000,"75,000.00",0.12,0.30
3,3,2201,COSMETOLOGY SERVICES AND CULINARY ARTS,Industrial Arts & Consumer Services,5411,72,3590,2701,316,0.08,"47,000.00",24500,"85,000.00",37575,29738,23249,1661,0.05,"41,600.00",29000,"60,000.00",0.13,0.13
4,4,2001,COMMUNICATION TECHNOLOGIES,Computers & Mathematics,9109,171,7512,5622,466,0.06,"57,000.00",40600,"83,700.00",53819,43163,34231,3389,0.07,"52,000.00",36000,"78,000.00",0.14,0.10

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 173 entries, 0 to 172
Data columns (total 23 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   index                         173 non-null    int64
 1   Major_code                    173 non-null    int64
 2   Major                         173 non-null    object
 3   Major_category                173 non-null    object
 4   Grad_total                    173 non-null    int64
 5   Grad_sample_size              173 non-null    int64
 6   Grad_employed                 173 non-null    int64
 7   Grad_full_time_year_round     173 non-null    int64
 8   Grad_unemployed               173 non-null    int64
 9   Grad_unemployment_rate        173 non-null    float64
 10  Grad_median                   173 non-null    float64
 11  Grad_P25                      173 non-null    int64
 12  Grad_P75                      173 non-null    float64
 13  Nongrad_total                 173 non-null    int64
 14  Nongrad_employed              173 non-null    int64
 15  Nongrad_full_time_year_round  173 non-null    int64
 16  Nongrad_unemployed            173 non-null    int64
 17  Nongrad_unemployment_rate     173 non-null    float64
 18  Nongrad_median                173 non-null    float64
 19  Nongrad_P25                   173 non-null    int64
 20  Nongrad_P75                   173 non-null    float64
 21  Grad_share                    173 non-null    float64
 22  Grad_premium                  173 non-null    float64
dtypes: float64(8), int64(13), object(2)
memory usage: 31.2+ KB
None

WOMEN_STEM

,index,Rank,Major_code,Major,Major_category,Total,Men,Women,ShareWomen,Median
0,0,1,2419,PETROLEUM ENGINEERING,Engineering,2339,2057,282,0.12,110000
1,1,2,2416,MINING AND MINERAL ENGINEERING,Engineering,756,679,77,0.10,75000
2,2,3,2415,METALLURGICAL ENGINEERING,Engineering,856,725,131,0.15,73000
3,3,4,2417,NAVAL ARCHITECTURE AND MARINE ENGINEERING,Engineering,1258,1123,135,0.11,70000
4,4,5,2418,NUCLEAR ENGINEERING,Engineering,2573,2200,373,0.14,65000

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 76 entries, 0 to 75
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   index           76 non-null     int64
 1   Rank            76 non-null     int64
 2   Major_code      76 non-null     int64
 3   Major           76 non-null     object
 4   Major_category  76 non-null     object
 5   Total           76 non-null     int64
 6   Men             76 non-null     int64
 7   Women           76 non-null     int64
 8   ShareWomen      76 non-null     float64
 9   Median          76 non-null     int64
dtypes: float64(1), int64(7), object(2)
memory usage: 6.1+ KB
None

MAJORS_LIST

,index,FOD1P,Major,Major_Category
0,0,1100,GENERAL AGRICULTURE,Agriculture & Natural Resources
1,1,1101,AGRICULTURE PRODUCTION AND MANAGEMENT,Agriculture & Natural Resources
2,2,1102,AGRICULTURAL ECONOMICS,Agriculture & Natural Resources
3,3,1103,ANIMAL SCIENCES,Agriculture & Natural Resources
4,4,1104,FOOD SCIENCE,Agriculture & Natural Resources

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 174 entries, 0 to 173
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   index           174 non-null    int64
 1   FOD1P           174 non-null    object
 2   Major           174 non-null    object
 3   Major_Category  173 non-null    object
dtypes: int64(1), object(3)
memory usage: 5.6+ KB
None

In [5]:
for df in datasets.values():
    if "index" in df.columns:
        df.drop(columns="index", inplace=True)

In [6]:
assert all_ages["Major_code"].is_unique
assert recent_grads["Major_code"].is_unique
assert grad_students["Major_code"].is_unique
assert women_stem["Major_code"].is_unique

- `Each dataset maintains a one-to-one relationship with Major_code, enabling safe joins later in SQL.`

In [7]:
for name, df in datasets.items():
    print(f"\n{name}")
    print(df.isna().sum())

all_ages
Major_code                       0
Major                            0
Major_category                   0
Total                            0
Employed                         0
Employed_full_time_year_round    0
Unemployed                       0
Unemployment_rate                0
Median                           0
P25th                            0
P75th                            0
dtype: int64

recent_grads
Rank                    0
Major_code              0
Major                   0
Major_category          0
Total                   0
Sample_size             0
Men                     0
Women                   0
ShareWomen              0
Employed                0
Full_time               0
Part_time               0
Full_time_year_round    0
Unemployed              0
Unemployment_rate       1
Median                  0
P25th                   0
P75th                   0
College_jobs            0
Non_college_jobs        0
Low_wage_jobs           0
dtype: int64

grad_students
Major_code                      0
Major                           0
Major_category                  0
Grad_total                      0
Grad_sample_size                0
Grad_employed                   0
Grad_full_time_year_round       0
Grad_unemployed                 0
Grad_unemployment_rate          0
Grad_median                     0
Grad_P25                        0
Grad_P75                        0
Nongrad_total                   0
Nongrad_employed                0
Nongrad_full_time_year_round    0
Nongrad_unemployed              0
Nongrad_unemployment_rate       0
Nongrad_median                  0
Nongrad_P25                     0
Nongrad_P75                     0
Grad_share                      0
Grad_premium                    0
dtype: int64

women_stem
Rank              0
Major_code        0
Major             0
Major_category    0
Total             0
Men               0
Women             0
ShareWomen        0
Median            0
dtype: int64

majors_list
FOD1P             0
Major             0
Major_Category    1
dtype: int64

In [8]:
salary_cols = ["Median", "P25th", "P75th"]

for col in salary_cols:
    if col in all_ages.columns:
        all_ages[col] = all_ages[col].astype("Int64")

In [9]:
recent_grads["Median"] = recent_grads["Median"].astype("Int64")
grad_students["Grad_median"] = grad_students["Grad_median"].astype("Int64")
grad_students["Nongrad_median"] = grad_students["Nongrad_median"].astype("Int64")

In [10]:
all_ages["employment_rate"] = (
    all_ages["Employed"] / all_ages["Total"]
)

In [11]:
all_ages["full_time_share"] = (
    all_ages["Employed_full_time_year_round"] / all_ages["Employed"]
)

In [12]:
all_ages["salary_spread"] = (
    all_ages["P75th"] - all_ages["P25th"]
)

In [13]:
grad_students["salary_premium"] = (
    grad_students["Grad_median"] - grad_students["Nongrad_median"]
)

In [14]:
all_ages["Major_category"] = all_ages["Major_category"].str.strip()
recent_grads["Major_category"] = recent_grads["Major_category"].str.strip()

In [15]:
all_ages[all_ages["Median"] > 150000][["Major", "Median"]]

Empty DataFrame
Columns: [Major, Median]
Index: []

In [16]:
for name, df in datasets.items():
    print(name, df.shape)

all_ages (173, 14)
recent_grads (173, 21)
grad_students (173, 23)
women_stem (76, 9)
majors_list (174, 3)

In [17]:
all_ages.to_csv("../data/cleaned/all_ages_cleaned.csv", index=False)
recent_grads.to_csv("../data/cleaned/recent_grads_cleaned.csv", index=False)
grad_students.to_csv("../data/cleaned/grad_students_cleaned.csv", index=False)
women_stem.to_csv("../data/cleaned/women_stem_cleaned.csv", index=False)
majors_list.to_csv("../data/cleaned/majors_list_cleaned.csv", index=False)

In [18]:
recent_grads["Unemployment_rate"] = recent_grads["Unemployment_rate"].fillna(0)

- `One missing unemployment rate was observed due to zero unemployed graduates. The value was set to 0 to reflect full employment.`

In [19]:
majors_list["Major_Category"] = majors_list["Major_Category"].fillna("Unknown")

- `One major lacked a category label and was assigned "Unknown" to preserve referential integrity.`

In [20]:
# Fix known missing values
recent_grads["Unemployment_rate"] = recent_grads["Unemployment_rate"].fillna(0)
majors_list["Major_Category"] = majors_list["Major_Category"].fillna("Unknown")